In [5]:
import numpy as np

In [12]:
import pandas as pd

In [17]:
df=pd.DataFrame({'name':['ram','shyam','gita'],'age':[10,20,30]})

In [22]:
df

   age   name
0   10    ram
1   20  shyam
2   30   gita

In [26]:
s = pd.Series([1,2,3,np.nan,4,5])

In [ ]:
s

In [31]:
dates=pd.date_range('20130101',periods=6)

In [32]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [33]:
df=pd.DataFrame(np.random.randn(6,4),index=list('abcdef'),columns=['I','II','III','IV'])

In [34]:
df

          I        II       III        IV
a -1.137010 -1.050891 -0.244905 -1.983780
b -0.193094 -0.193468 -0.052383  0.883396
c  0.701696  2.046251  1.115225 -0.904961
d -0.492426 -0.738426  2.336909 -0.412076
e -0.328238  0.211373  0.330796  0.568544
f -1.455466 -1.099828 -0.475610  1.399173

In [35]:
pd.Timestamp('20130102')

Timestamp('2013-01-02 00:00:00')

In [36]:
pd.Series(1,index=list(range(4)),dtype='float32')

0    1.0
1    1.0
2    1.0
3    1.0
dtype: float32

In [37]:
np.array([3]*4,dtype='int32')

array([3, 3, 3, 3], dtype=int32)

In [38]:
pd.Categorical(['test','train','test','train'])

[test, train, test, train]
Categories (2, object): [test, train]

In [39]:
df2 = pd.DataFrame({
    'A': 1,
    'B': pd.Timestamp('20130102'),
    'C': pd.Series(1,index=list(range(4)),dtype='float32'),
    'D': np.array([3]*4,dtype='int32'),
    'E': pd.Categorical(['test','train','test','train']),
    'F': 'foo'
    
})

In [40]:
df2

   A          B    C  D      E    F
0  1 2013-01-02  1.0  3   test  foo
1  1 2013-01-02  1.0  3  train  foo
2  1 2013-01-02  1.0  3   test  foo
3  1 2013-01-02  1.0  3  train  foo

In [41]:
df2.dtypes

A             int64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [42]:
df.head()

          I        II       III        IV
a -1.137010 -1.050891 -0.244905 -1.983780
b -0.193094 -0.193468 -0.052383  0.883396
c  0.701696  2.046251  1.115225 -0.904961
d -0.492426 -0.738426  2.336909 -0.412076
e -0.328238  0.211373  0.330796  0.568544

In [43]:
df.tail(2)

          I        II       III        IV
e -0.328238  0.211373  0.330796  0.568544
f -1.455466 -1.099828 -0.475610  1.399173

In [44]:
df.index

Index([u'a', u'b', u'c', u'd', u'e', u'f'], dtype='object')

In [45]:
df.columns

Index([u'I', u'II', u'III', u'IV'], dtype='object')

In [46]:
df.values

array([[-1.13701004, -1.05089079, -0.24490495, -1.9837797 ],
       [-0.19309382, -0.19346759, -0.05238305,  0.88339643],
       [ 0.70169567,  2.0462507 ,  1.11522451, -0.90496097],
       [-0.49242586, -0.73842558,  2.33690927, -0.41207566],
       [-0.32823764,  0.21137322,  0.33079589,  0.56854382],
       [-1.45546553, -1.09982814, -0.47560977,  1.39917349]])

In [47]:
df.describe()

              I        II       III        IV
count  6.000000  6.000000  6.000000  6.000000
mean  -0.484090 -0.137498  0.501672 -0.074950
std    0.759605  1.184490  1.057655  1.261091
min   -1.455466 -1.099828 -0.475610 -1.983780
25%   -0.975864 -0.972774 -0.196774 -0.781740
50%   -0.410332 -0.465947  0.139206  0.078234
75%   -0.226880  0.110163  0.919117  0.804683
max    0.701696  2.046251  2.336909  1.399173

In [48]:
df

          I        II       III        IV
a -1.137010 -1.050891 -0.244905 -1.983780
b -0.193094 -0.193468 -0.052383  0.883396
c  0.701696  2.046251  1.115225 -0.904961
d -0.492426 -0.738426  2.336909 -0.412076
e -0.328238  0.211373  0.330796  0.568544
f -1.455466 -1.099828 -0.475610  1.399173

In [49]:
df.sort_values(by='I')

          I        II       III        IV
f -1.455466 -1.099828 -0.475610  1.399173
a -1.137010 -1.050891 -0.244905 -1.983780
d -0.492426 -0.738426  2.336909 -0.412076
e -0.328238  0.211373  0.330796  0.568544
b -0.193094 -0.193468 -0.052383  0.883396
c  0.701696  2.046251  1.115225 -0.904961

In [50]:
df.sort_values(by=['I','II'])

          I        II       III        IV
f -1.455466 -1.099828 -0.475610  1.399173
a -1.137010 -1.050891 -0.244905 -1.983780
d -0.492426 -0.738426  2.336909 -0.412076
e -0.328238  0.211373  0.330796  0.568544
b -0.193094 -0.193468 -0.052383  0.883396
c  0.701696  2.046251  1.115225 -0.904961

In [51]:
df.columns

Index([u'I', u'II', u'III', u'IV'], dtype='object')

In [52]:
df['I']

a   -1.137010
b   -0.193094
c    0.701696
d   -0.492426
e   -0.328238
f   -1.455466
Name: I, dtype: float64

In [53]:
df['IV']

a   -1.983780
b    0.883396
c   -0.904961
d   -0.412076
e    0.568544
f    1.399173
Name: IV, dtype: float64

In [54]:
df[0:3]

          I        II       III        IV
a -1.137010 -1.050891 -0.244905 -1.983780
b -0.193094 -0.193468 -0.052383  0.883396
c  0.701696  2.046251  1.115225 -0.904961

In [55]:
df[2:3]

          I        II       III        IV
c  0.701696  2.046251  1.115225 -0.904961

In [56]:
df.index

Index([u'a', u'b', u'c', u'd', u'e', u'f'], dtype='object')

In [57]:
df['a':'b']

          I        II       III        IV
a -1.137010 -1.050891 -0.244905 -1.983780
b -0.193094 -0.193468 -0.052383  0.883396

In [58]:
df['II']['a':'c']

a   -1.050891
b   -0.193468
c    2.046251
Name: II, dtype: float64

In [59]:
df

          I        II       III        IV
a -1.137010 -1.050891 -0.244905 -1.983780
b -0.193094 -0.193468 -0.052383  0.883396
c  0.701696  2.046251  1.115225 -0.904961
d -0.492426 -0.738426  2.336909 -0.412076
e -0.328238  0.211373  0.330796  0.568544
f -1.455466 -1.099828 -0.475610  1.399173

In [65]:
df.loc['a']

I     -1.137010
II    -1.050891
III   -0.244905
IV    -1.983780
Name: a, dtype: float64

In [66]:
df.loc[:,['I','II']]

          I        II
a -1.137010 -1.050891
b -0.193094 -0.193468
c  0.701696  2.046251
d -0.492426 -0.738426
e -0.328238  0.211373
f -1.455466 -1.099828

In [67]:
df.loc['a':'c',['I','IV']]

          I        IV
a -1.137010 -1.983780
b -0.193094  0.883396
c  0.701696 -0.904961

In [68]:
df.loc['a',['I']]

I   -1.13701
Name: a, dtype: float64

In [71]:
df.iloc[3]

I     -0.492426
II    -0.738426
III    2.336909
IV    -0.412076
Name: d, dtype: float64

In [72]:
df.iloc[1:3,0:2]

          I        II
b -0.193094 -0.193468
c  0.701696  2.046251

In [73]:
df.iloc[1,1]

-0.1934675882489065

In [74]:
df

          I        II       III        IV
a -1.137010 -1.050891 -0.244905 -1.983780
b -0.193094 -0.193468 -0.052383  0.883396
c  0.701696  2.046251  1.115225 -0.904961
d -0.492426 -0.738426  2.336909 -0.412076
e -0.328238  0.211373  0.330796  0.568544
f -1.455466 -1.099828 -0.475610  1.399173

In [81]:
df[df.I>0]

          I        II       III        IV
c  0.701696  2.046251  1.115225 -0.904961

In [82]:
df2=df.copy()

In [84]:
df2['v']=['ram','shyam','hari','gita','rita','nabin']

In [85]:
df2

          I        II       III        IV      v
a -1.137010 -1.050891 -0.244905 -1.983780    ram
b -0.193094 -0.193468 -0.052383  0.883396  shyam
c  0.701696  2.046251  1.115225 -0.904961   hari
d -0.492426 -0.738426  2.336909 -0.412076   gita
e -0.328238  0.211373  0.330796  0.568544   rita
f -1.455466 -1.099828 -0.475610  1.399173  nabin

In [86]:
df

          I        II       III        IV
a -1.137010 -1.050891 -0.244905 -1.983780
b -0.193094 -0.193468 -0.052383  0.883396
c  0.701696  2.046251  1.115225 -0.904961
d -0.492426 -0.738426  2.336909 -0.412076
e -0.328238  0.211373  0.330796  0.568544
f -1.455466 -1.099828 -0.475610  1.399173

In [87]:
df2

          I        II       III        IV      v
a -1.137010 -1.050891 -0.244905 -1.983780    ram
b -0.193094 -0.193468 -0.052383  0.883396  shyam
c  0.701696  2.046251  1.115225 -0.904961   hari
d -0.492426 -0.738426  2.336909 -0.412076   gita
e -0.328238  0.211373  0.330796  0.568544   rita
f -1.455466 -1.099828 -0.475610  1.399173  nabin

In [94]:
df2[df2['v'].isin(['ram','hari'])]

          I        II       III        IV     v
a -1.137010 -1.050891 -0.244905 -1.983780   ram
c  0.701696  2.046251  1.115225 -0.904961  hari

In [112]:
df1 = df.reindex(index=list('abcd'),columns=list(df.columns)+['F'])

In [113]:
df1

          I        II       III        IV   F
a -1.137010 -1.050891 -0.244905 -1.983780 NaN
b -0.193094 -0.193468 -0.052383  0.883396 NaN
c  0.701696  2.046251  1.115225 -0.904961 NaN
d -0.492426 -0.738426  2.336909 -0.412076 NaN

In [117]:
df1.loc['a':'b','F'] = 1

In [118]:
df1

          I        II       III        IV    F
a -1.137010 -1.050891 -0.244905 -1.983780  1.0
b -0.193094 -0.193468 -0.052383  0.883396  1.0
c  0.701696  2.046251  1.115225 -0.904961  NaN
d -0.492426 -0.738426  2.336909 -0.412076  NaN

In [127]:
df1.dropna(axis=0)

          I        II       III        IV    F
a -1.137010 -1.050891 -0.244905 -1.983780  1.0
b -0.193094 -0.193468 -0.052383  0.883396  1.0

In [128]:
df1

          I        II       III        IV    F
a -1.137010 -1.050891 -0.244905 -1.983780  1.0
b -0.193094 -0.193468 -0.052383  0.883396  1.0
c  0.701696  2.046251  1.115225 -0.904961  NaN
d -0.492426 -0.738426  2.336909 -0.412076  NaN

In [131]:
np.mean(df.I)

-0.48408953846862185

In [138]:
np.mean(df.loc['a',:])

-1.1041463713944302